# Chapter 6

In [5]:
import pandas as pd

In [6]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
df = pd.read_csv('examples/ex1.csv')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [11]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
names = ['a','b','c','d', 'message']

In [14]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [15]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [16]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1','key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [20]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
result = pd.read_csv('examples/ex5.csv')

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [26]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
sentinels = {'message': ['foo','NA'], 'something':['two']}

In [28]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [29]:
pd.options.display.max_rows = 10

In [30]:
result = pd.read_csv('examples/ex6.csv')

In [31]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [32]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [33]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [34]:
chunker

In [35]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

<ipython-input-35-ff8a04991e79>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [36]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [37]:
data = pd.read_csv('examples/ex5.csv')

In [38]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
data.to_csv('examples/out.csv')

In [40]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [41]:
import sys

In [42]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [46]:
dates = pd.date_range('1/1/2000', periods=7)

In [47]:
import numpy as np

In [48]:
ts = pd.Series(np.arange(7), index=dates)

In [49]:
ts.to_csv('examples/tseries.csv')

In [50]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [51]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [52]:
import csv

In [53]:
f = open('examples/ex7.csv')

In [54]:
reader = csv.reader(f)

In [55]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [56]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [57]:
header, values = lines[0], lines[1:]

In [58]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [59]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [60]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

reader = csv.reader(f, delimter='|')

In [61]:
with open('mydata.csv', 'w') as f:
    writer= csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [62]:
import json

In [63]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [64]:
result = json.loads(obj)

In [65]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [66]:
asjson = json.dumps(result)

In [67]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [68]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [69]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [70]:
data = pd.read_json('examples/example.json')

In [71]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [72]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [73]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [74]:
conda install lxml

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [75]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /Users/sheng/opt/anaconda3/lib/python3.8/site-packages (4.9.3)
Requirement already satisfied: html5lib in /Users/sheng/opt/anaconda3/lib/python3.8/site-packages (1.1)
Requirement already satisfied: soupsieve>1.2; python_version >= "3.0" in /Users/sheng/opt/anaconda3/lib/python3.8/site-packages (from beautifulsoup4) (2.0.1)
Requirement already satisfied: six>=1.9 in /Users/sheng/opt/anaconda3/lib/python3.8/site-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /Users/sheng/opt/anaconda3/lib/python3.8/site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [76]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [77]:
len(tables)

1

In [78]:
failures = tables[0]

In [79]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [80]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [81]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [82]:
from lxml import objectify

In [83]:
path = 'examples/mta_perf/Performance_MNR.xml'

In [84]:
<INDICATOR>
    <INDICATOR_SEQ>373889</INDICATOR_SEQ>
    <PARENT_SEQ></PARENT_SEQ>
    <AGENCY_NAME>Metro-North Railroad</AGENCY_NAME>
    <INDICATOR_NAME>Escalator Availability</INDICATOR_NAME>
    <DESCRIPTION>Percent of the time that escalators are operational
     systemwide. The availability rate is based on physical observations performed
     the morning of regular business days only. This is a new indicator the agency
     began reporting in 2009.</DESCRIPTION>
    <PERIOD_YEAR>2011</PERIOD_YEAR>
    <PERIOD_MONTH>12</PERIOD_MONTH>
    <CATEGORY>Service Indicators</CATEGORY>
    <FREQUENCY>M</FREQUENCY>
    <DESIRED_CHANGE>U</DESIRED_CHANGE>
    <INDICATOR_UNIT>%</INDICATOR_UNIT>
    <DECIMAL_PLACES>1</DECIMAL_PLACES>
    <YTD_TARGET>97.00</YTD_TARGET>
    <YTD_ACTUAL></YTD_ACTUAL>
    <MONTHLY_TARGET>97.00</MONTHLY_TARGET>
    <MONTHLY_ACTUAL></MONTHLY_ACTUAL>
</INDICATOR>

SyntaxError: invalid syntax (<ipython-input-84-6aa2efa91598>, line 1)

In [ ]:
#Page 182 did not finish the code due to file missing

In [85]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [86]:
root

In [87]:
root.get('href')

'http://www.google.com'

In [88]:
root.text

'Google'

In [89]:
frame = pd.read_csv('examples/ex1.csv')

In [90]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [91]:
frame.to_pickle('examples/frame_pickle')

In [92]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [93]:
#types of files, pickles, bcolz, feather, and hdf5

In [98]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [101]:
store = pd.HDFStore('mydata1.h5')

In [102]:
store['obj1'] = frame

In [103]:
store['obj1_col'] = frame['a']

In [104]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata1.h5

In [105]:
store['obj1']

           a
0   1.772919
1  -0.874303
2  -2.202787
3   1.103542
4  -0.266336
..       ...
95 -0.064557
96  1.511086
97 -1.915072
98  1.713980
99  0.380150

[100 rows x 1 columns]

In [106]:
store.put('obj2', frame, format='table')

In [107]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.053942
11 -0.100615
12  0.768141
13  1.860576
14 -0.645098
15 -0.975858

In [108]:
store.close()

In [110]:
frame.to_hdf('mydata1.h5', 'obj3', format='table')

In [111]:
pd.read_hdf('mydata1.h5', 'obj3', where=['index < 5'])

          a
0  1.772919
1 -0.874303
2 -2.202787
3  1.103542
4 -0.266336

In [114]:
#hdf files are generally write once and read many times, too many writers can corrupt

In [115]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
     |â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ| 103 kB 9.2 MB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0

In [116]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [117]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [118]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [119]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [122]:
conda install openpyxl

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/sheng/opt/anaconda3

  added / updated specs:
    - openpyxl


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    openpyxl-3.0.5             |             py_0         158 KB
    ------------------------------------------------------------
                                           Total:         158 KB

The following NEW packages will be INSTALLED:

  et_xmlfile         pkgs/main/noarch::et_xmlfile-1.0.1-py_1001
  jdcal              pkgs/main/noarch::jdcal-1.4.1-py_0
  openpyxl           pkgs/main/noarch::openpyxl-3.0.5-py_0



Downloading and Extracting Packages
openpyxl-3.0.5       | 158 KB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [123]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [124]:
frame.to_excel(writer, 'Sheet1')

In [125]:
writer.save()

In [126]:
frame.to_excel('examples/ex2.xlsx')

In [127]:
import requests

In [128]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [129]:
resp = requests.get(url)

In [130]:
resp

In [131]:
data = resp.json()

In [140]:
data[0]['title']

'CLN: Use new hashtables in libindex to avoid casting'

In [141]:
issues = pd.DataFrame(data, columns=['number', 'title',
        'labels', 'state'])

In [142]:
issues

,number,title,labels,state
0,37994,CLN: Use new hashtables in libindex to avoid c...,[],open
1,37993,[WIP] DOC: MultiIndex EX01 errors,[],open
2,37992,Bug in DataFrame.loc returning elements in wro...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
3,37991,CLN: always pass ndim to make_block,[],open
4,37990,CLN: avoid try/except in Index methods,[],open
...,...,...,...,...
25,37947,Slow autocompletion in python/ipython console ...,[],open
26,37941,ENH: An argument for .query() that returns all...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
27,37939,QST: how to run Pandas tests involving Numba o...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
28,37937,BUG: Concat automatically sorts index when axi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,37935,BUG: json_normalize() upcasts column with miss...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

In [143]:
import sqlite3

In [147]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAT(20),
c REAL, d INTEGER
);"""

In [148]:
con = sqlite3.connect('mydata.sqlite')

In [149]:
con.execute(query)

In [150]:
con.commit()

In [151]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [152]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [153]:
con.executemany(stmt, data)

In [154]:
con.commit()

In [155]:
cursor = con.execute('select * from test')

In [156]:
rows = cursor.fetchall()

In [157]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [158]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [161]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [163]:
conda install sqlalchemy

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/sheng/opt/anaconda3

  added / updated specs:
    - sqlalchemy


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    sqlalchemy-1.3.20          |   py38h9ed2024_0         1.5 MB
    ------------------------------------------------------------
                                           Total:         1.5 MB

The following NEW packages will be INSTALLED:

  sqlalchemy         pkgs/main/osx-64::sqlalchemy-1.3.20-py38h9ed2024_0



Downloading and Extracting Packages
sqlalchemy-1.3.20    | 1.5 MB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [164]:
import sqlalchemy as sqla

In [167]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [168]:
pd.real_sql('select * from test', db)

AttributeError: module 'pandas' has no attribute 'real_sql'